In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data1=pd.read_excel("doc1.xlsx",sheet_name="h")

In [ ]:
data1

   fwasfasfsfasff  aef
0             NaN   af
1             NaN  NaN
2             NaN  NaN
3             NaN   sf

In [ ]:
data1=pd.read_excel("doc1.xlsx",sheet_name="Sheet1")
data1

  qwmf   ef
0  asdf  sf

In [ ]:
ipl=pd.read_html("https://www.iplt20.com/stats/2019")

In [ ]:
type(ipl)

list

In [ ]:
len(ipl)

1

In [ ]:
type(ipl[0])

pandas.core.frame.DataFrame

In [ ]:
ipl[0].to_csv("ipl_data.csv")

In [ ]:
pwd()

'/content'

In [ ]:
ipld=ipl[0]

In [ ]:
ipld.columns

Index(['Unnamed: 0', 'Team', 'Pld', 'Won', 'Lost', 'Tied', 'N/R', 'Net RR',
       'For', 'Against', 'Pts', 'Form'],
      dtype='object')

In [ ]:
pd.read_csv("ipl_data.csv",nrows=4)

   Unnamed: 0 Unnamed: 0.1  ... Pts           Form
0           0            Q  ...  18  L  W  L  W  W
1           1            Q  ...  18  L  W  L  W  L
2           2            Q  ...  18  W  W  W  L  W
3           3            Q  ...  12  L  L  W  L  L

[4 rows x 13 columns]

In [ ]:
pd.read_csv("ipl_data.csv").head(4)

   Unnamed: 0 Unnamed: 0.1  ... Pts           Form
0           0            Q  ...  18  L  W  L  W  W
1           1            Q  ...  18  L  W  L  W  L
2           2            Q  ...  18  W  W  W  L  W
3           3            Q  ...  12  L  L  W  L  L

[4 rows x 13 columns]

In [ ]:
d=pd.date_range("9/9/2020",periods=7,freq="y")

In [ ]:
range(10)

range(0, 10)

In [ ]:
pd.Series(range(7),index=d)

2020-12-31    0
2021-12-31    1
2022-12-31    2
2023-12-31    3
2024-12-31    4
2025-12-31    5
2026-12-31    6
Freq: A-DEC, dtype: int64

In [ ]:
pd.Series(range(8),index=d)

ValueError: ignored

In [ ]:
a=pd.Series(range(4),index=["a","b","c","d"])

In [ ]:
a

a    0
b    1
c    2
d    3
dtype: int64

In [ ]:
a["a"]

0

In [ ]:
a["b"]

1

In [ ]:
a[3]

3

In [ ]:
ipld.loc[1]

Unnamed: 0                           Q
Team          Chennai Super Kings  CSK
Pld                                 14
Won                                  9
Lost                                 5
Tied                                 0
N/R                                  0
Net RR                           0.131
For                        2,043/274.1
Against                    2,012/274.5
Pts                                 18
Form                     L  W  L  W  L
Name: 1, dtype: object

In [ ]:
data2=pd.read_csv("test.csv")

In [ ]:
data2.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [ ]:
data2=data2.drop("Name",axis=1)

In [ ]:
data2.head()

   PassengerId  Pclass     Sex   Age  ...   Ticket     Fare Cabin  Embarked
0          892       3    male  34.5  ...   330911   7.8292   NaN         Q
1          893       3  female  47.0  ...   363272   7.0000   NaN         S
2          894       2    male  62.0  ...   240276   9.6875   NaN         Q
3          895       3    male  27.0  ...   315154   8.6625   NaN         S
4          896       3  female  22.0  ...  3101298  12.2875   NaN         S

[5 rows x 10 columns]

In [ ]:
data2.drop("PassengerId",axis=1,inplace=True)

In [ ]:
data2

     Pclass     Sex   Age  SibSp  ...              Ticket      Fare  Cabin Embarked
0         3    male  34.5      0  ...              330911    7.8292    NaN        Q
1         3  female  47.0      1  ...              363272    7.0000    NaN        S
2         2    male  62.0      0  ...              240276    9.6875    NaN        Q
3         3    male  27.0      0  ...              315154    8.6625    NaN        S
4         3  female  22.0      1  ...             3101298   12.2875    NaN        S
..      ...     ...   ...    ...  ...                 ...       ...    ...      ...
413       3    male   NaN      0  ...           A.5. 3236    8.0500    NaN        S
414       1  female  39.0      0  ...            PC 17758  108.9000   C105        C
415       3    male  38.5      0  ...  SOTON/O.Q. 3101262    7.2500    NaN        S
416       3    male   NaN      0  ...              359309    8.0500    NaN        S
417       3    male   NaN      1  ...                2668   22.3583    NaN        C

[418 rows x 9 columns]

In [ ]:
del data2["Pclass"]

In [ ]:
data2

        Sex   Age  SibSp  Parch              Ticket      Fare Cabin Embarked
0      male  34.5      0      0              330911    7.8292   NaN        Q
1    female  47.0      1      0              363272    7.0000   NaN        S
2      male  62.0      0      0              240276    9.6875   NaN        Q
3      male  27.0      0      0              315154    8.6625   NaN        S
4    female  22.0      1      1             3101298   12.2875   NaN        S
..      ...   ...    ...    ...                 ...       ...   ...      ...
413    male   NaN      0      0           A.5. 3236    8.0500   NaN        S
414  female  39.0      0      0            PC 17758  108.9000  C105        C
415    male  38.5      0      0  SOTON/O.Q. 3101262    7.2500   NaN        S
416    male   NaN      0      0              359309    8.0500   NaN        S
417    male   NaN      1      1                2668   22.3583   NaN        C

[418 rows x 8 columns]

In [ ]:
data2["new"]=data2["Age"]+data2["Fare"]

In [ ]:
data2.head()

      Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked      new
0    male  34.5      0      0   330911   7.8292   NaN        Q  42.3292
1  female  47.0      1      0   363272   7.0000   NaN        S  54.0000
2    male  62.0      0      0   240276   9.6875   NaN        Q  71.6875
3    male  27.0      0      0   315154   8.6625   NaN        S  35.6625
4  female  22.0      1      1  3101298  12.2875   NaN        S  34.2875

In [ ]:
data2.isnull().sum()#imp

Sex           0
Age          86
SibSp         0
Parch         0
Ticket        0
Fare          1
Cabin       327
Embarked      0
new          87
dtype: int64

In [ ]:
data2["Sex"].value_counts()#imp

male      266
female    152
Name: Sex, dtype: int64

In [ ]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sex       418 non-null    object
 1   Age       332 non-null    float64
 2   SibSp     418 non-null    int64
 3   Parch     418 non-null    int64
 4   Ticket    418 non-null    object
 5   Fare      417 non-null    float64
 6   Cabin     91 non-null     object
 7   Embarked  418 non-null    object
 8   new       331 non-null    float64
dtypes: float64(3), int64(2), object(4)
memory usage: 29.5+ KB

In [ ]:
data2.describe()

              Age       SibSp       Parch        Fare         new
count  332.000000  418.000000  418.000000  417.000000  331.000000
mean    30.272590    0.447368    0.392344   35.627188   71.163356
std     14.181209    0.896760    0.981429   55.907576   67.316807
min      0.170000    0.000000    0.000000    0.000000   10.180000
25%     21.000000    0.000000    0.000000    7.895800   33.175000
50%     27.000000    0.000000    0.000000   14.454200   48.025000
75%     39.000000    1.000000    0.000000   31.500000   80.443750
max     76.000000    8.000000    9.000000  512.329200  570.329200

In [ ]:
ind=["a","b","c","d","e"]

In [ ]:
data=pd.read_csv("Data.csv",index_col="name")

       maths  phy result
name
tom       80   70   Pass
jhon      75   67   Pass
max       28   55   Fail
raj       88   70   Pass
shyam     23   29   Fail
ram       95   89   Pass

In [ ]:
data.iloc[0]

name       tom
maths       80
phy         70
result    Pass
Name: 0, dtype: object

In [ ]:
data.loc["tom"]

maths       80
phy         70
result    Pass
Name: tom, dtype: object

In [ ]:
data.iloc[0]

maths       80
phy         70
result    Pass
Name: tom, dtype: object

In [ ]:
data

       maths  phy result
name
tom       80   70   Pass
jhon      75   67   Pass
max       28   55   Fail
raj       88   70   Pass
shyam     23   29   Fail
ram       95   89   Pass

In [ ]:
data.loc["shyam"]

maths       23
phy         29
result    Fail
Name: shyam, dtype: object

In [ ]:
data.iloc[4]

maths       23
phy         29
result    Fail
Name: shyam, dtype: object